<html>
 <head></head>
 <body>
  <h2 style="text-align: center;">Использование вложенных циклов при решении уравнений</h2> 
  <p>Вложенные циклы можно использовать для решения уравнений с несколькими переменными. Зная, что решения (корни) уравнения являются натуральными (целыми) числами, несложно написать программу, содержащую вложенный цикл и перебирающую все возможные значения переменных.</p> 
  <h2 style="text-align: center;">Решение задач</h2> 
  <p><strong>Задача 1.</strong>&nbsp;Найдите все пары натуральных чисел (и их количество) являющихся решением уравнения&nbsp;$12x+13y = 777$.</p> 
  <p><strong>Решение.</strong> Поскольку по условию числа $x$ и $y$ являются натуральными, то $x \le 64, \, y \le 59&nbsp;$. Напишем программу, которая перебирает всевозможные пары чисел $(x; \, y)$ и проверяет для них выполнение условия&nbsp;$12x+13y = 777$.</p> 
  <pre><code class="language-python">total = 0
for x in range(1, 65):
    for y in range(1, 60):
        if 12 * x + 13 * y == 777:
            total += 1
            print('x =', x, 'y =', y)
print('Общее количество натуральных решений =', total)</code></pre> 
  <p>В результате выполнения такого кода, мы получим:</p> 
  <pre><code class="language-no-highlight">x = 3 y = 57
x = 16 y = 45
x = 29 y = 33
x = 42 y = 21
x = 55 y = 9
Общее количество натуральных решений = 5</code></pre> 
  <p><strong>Задача 2.</strong> Найдите все пары натуральных чисел (и их количество) являющихся решением уравнения $x^2+y^2+z^2 = 2020$.</p> 
  <p><strong>Решение.</strong>&nbsp;&nbsp;Поскольку по условию числа $x, \, y$ и $z$ являются натуральными, то $x, y, z \le \sqrt{2020} = 45$.&nbsp;Напишем программу, которая перебирает всевозможные тройки чисел $(x; \, y; \, z)$ и проверяет для них условие $x^2+y^2+z^2 = 2020$.</p> 
  <pre><code class="language-python">total = 0
for x in range(1, 45):
    for y in range(1, 45):
        for z in range(1, 45):
            if x ** 2 + y ** 2 + z ** 2 == 2020:
                total += 1
                print('x =', x, 'y =', y, 'z =', z)
print('Общее количество натуральных решений =', total)</code></pre> 
  <p>В результате выполнения такого кода, мы получим:</p> 
  <pre><code class="language-no-highlight">x = 18 y = 20 z = 36
x = 18 y = 36 z = 20
x = 20 y = 18 z = 36
x = 20 y = 36 z = 18
x = 36 y = 18 z = 20
x = 36 y = 20 z = 18
Общее количество натуральных решений = 6</code></pre> 
  <h2 style="text-align: right;">❤️ Happy Pythoning! 🐍&nbsp;</h2>
 </body>
</html>