<html>
 <head></head>
 <body>
  <h2 style="text-align: center;">Решение задач</h2> 
  <p><strong>Задача 1.</strong> Профессор Тимур преподает вводный курс статистики и попросил вас написать программу, которую он мог бы использовать на занятиях для имитации бросания игральных кубиков. Программа должна случайным образом генерировать два числа в диапазоне от $1$ до $6$ и показывать их.</p> 
  <p><strong>Решение.</strong> Для генерации целых чисел мы будем использовать функцию <code>randint()</code>:</p> 
  <pre><code class="language-python">import random

print('Бросаем кубики... ')
print('Значения граней:')
print(random.randint(1, 6))
print(random.randint(1, 6))</code></pre> 
  <p><strong>Задача 2.</strong> В интервью с профессором Тимуром вы выясняете, что он хотел бы использовать программу для имитации нескольких поочередных бросаний кубика.</p> 
  <p><strong>Решение.</strong> Будем использовать&nbsp;цикл <code>while</code>, который имитирует один бросок кубиков и затем спрашивает пользователя,<br> следует ли сделать еще один бросок. Цикл будет&nbsp;повторяться до тех пор, пока пользователь отвечает "да", набирая букву "д":</p> 
  <pre><code class="language-python">import random

again = 'д'
while again.lower() == 'д':
    print('Бросаем кубики... ')
    print('Значения граней:')
    print(random.randint(1, 6))
    print(random.randint(1, 6))
    again = input('Бросить кубики еще раз? (д = да, н = нет): ')</code></pre> 
  <p><strong>Задача 3.</strong> Профессор Тимур&nbsp;был так доволен написанным вами симулятором бросания кубиков,&nbsp;что попросил вас разработать еще одну программу. Он хотел бы иметь симулятор десятикратного поочередного подбрасывания монеты. Всякий раз, когда программа имитирует подбрасывание монеты, она должна случайным образом показывать "орла" или "решку".</p> 
  <p><strong>Решение.</strong> Мы можем сымитировать бросание монеты путем генерации случайного числа в диапазоне от 0&nbsp;до 1.&nbsp;Для генерации целых чисел мы будем использовать функцию <code>randint()</code>:</p> 
  <pre><code class="language-python">import random

for _ in range(10):
    num = random.randint(0, 1)
    if num == 0:
        print('Орел')
    else:
        print('Решка')</code></pre>
 </body>
</html>